app/controllers/plans_controller.rb

INSERT INTO "plans" ("name", "price", "ocurrency", "about", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Free"], ["price", nil], ["ocurrency", nil], ["about", nil], ["created_at", "2024-12-08 00:39:26.453881"], ["updated_at", "2024-12-08 00:39:26.453881"]]
---
  def create
    @plan = Plan.new(plan_params)

    if @plan.save

UPDATE "plans" SET "name" = $1, "price" = $2, "updated_at" = $3 WHERE "plans"."id" = $4  [["name", "Companies"], ["price", 2.5], ["updated_at", "2024-12-08 18:17:04.175430"], ["id", 1]]
---
  def update
    if @plan.update(plan_params)

DELETE FROM "plans" WHERE "plans"."id" = $1  [["id", 1]]
---
  def destroy
    @plan.destroy!